### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [114]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [115]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [116]:
# Check to see if a player purchased multiple times
player = purchase_data["SN"].value_counts()
player.head()

Lisosia93      5
Iral74         4
Idastidru52    4
Hada39         3
Rarallo90      3
Name: SN, dtype: int64

In [117]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [118]:
player_count_df = pd.DataFrame({"Total Players": [player_count]})
player_count_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [119]:
# Check to see if items are purchased multiple times
items_name = purchase_data["Item Name"].value_counts()
items_name.head()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Nirvana                                          9
Fiery Glass Crusader                             9
Extraction, Quickblade Of Trembling Hands        9
Name: Item Name, dtype: int64

In [120]:
unique_item_count = len(purchase_data["Item Name"].unique())
unique_item_count

179

In [121]:
average_price = purchase_data["Price"].mean()
average_price

3.0509871794871795

In [122]:
purchase_count = purchase_data["Purchase ID"].count()
purchase_count

780

In [123]:
revenue = purchase_data["Price"].sum()
revenue

2379.77

In [124]:
summary_df = pd.DataFrame({"Number of Unique Items":[unique_item_count],
                          "Average Price":[average_price],
                          "Number of Purchases":[purchase_count],
                          "Total Revenue":[revenue]})
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [125]:
summary_df.dtypes

Number of Unique Items      int64
Average Price             float64
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [126]:
summary_df["Average Price"]= pd.to_numeric(summary_df["Average Price"])

In [127]:
summary_df["Average Price"] = summary_df["Average Price"].astype(float).map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].astype(float).map("${:,.2f}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [128]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [129]:
gender_demographics = purchase_data[["SN","Gender"]]
gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
775     Aethedru70  Female
776         Iral74    Male
777     Yathecal72    Male
778        Sisur91    Male
779      Ennrian78    Male

[780 rows x 2 columns]

In [130]:
updated_gender_demographics = gender_demographics.drop_duplicates()
updated_gender_demographics

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [131]:
gender_list = list(updated_gender_demographics["Gender"].unique())
gender_list

['Male', 'Other / Non-Disclosed', 'Female']

In [132]:
# Reorder the gender list
updated_gender_list = ["Male", "Female", "Other / Non-Disclosed"]
updated_gender_list

['Male', 'Female', 'Other / Non-Disclosed']

In [133]:
male_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Male"])
male_count

484

In [134]:
female_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Female"])
female_count

81

In [135]:
others_count = len(updated_gender_demographics[updated_gender_demographics["Gender"] == "Other / Non-Disclosed"])
others_count

11

In [136]:
player_count = len(purchase_data["SN"].unique())
player_count

576

In [137]:
total_count = [male_count,
             female_count,
             others_count]
total_count

[484, 81, 11]

In [138]:
gender_percentage = [(male_count/player_count)*100,
             (female_count/player_count)*100,
            (others_count/player_count)*100]
gender_percentage

[84.02777777777779, 14.0625, 1.9097222222222223]

In [139]:
gender_demographics_df = pd.DataFrame({"": updated_gender_list,"Total Count": total_count,
                                       "Percentage of Players": gender_percentage})
gender_demographics_df

                          Total Count  Percentage of Players
0                   Male          484              84.027778
1                 Female           81              14.062500
2  Other / Non-Disclosed           11               1.909722

In [140]:
gender_demographics_df.set_index("", inplace=True)
gender_demographics_df

                       Total Count  Percentage of Players

Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [141]:
gender_demographics_df.dtypes

Total Count                int64
Percentage of Players    float64
dtype: object

In [142]:
gender_demographics_df["Percentage of Players"]= pd.to_numeric(gender_demographics_df["Percentage of Players"])

In [143]:
gender_demographics_df["Percentage of Players"] = gender_demographics_df["Percentage of Players"].astype(float).map("{:,.2f}%".format)
gender_demographics_df

                       Total Count Percentage of Players

Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [144]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [145]:
gender_group = purchase_data.groupby("Gender")
gender_group.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89
18,18,Reunasu60,22,Female,82,Nirvana,4.90
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [146]:
purchase_count = gender_group["Purchase ID"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [147]:
average_purchase = gender_group["Price"].mean()
average_purchase

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [148]:
total_purchase = gender_group["Price"].sum()
total_purchase

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [149]:
# Utilizing the unique gender count from the previous section
total_count_pa = [female_count,
               male_count,
             others_count]
total_count_pa

[81, 484, 11]

In [150]:
avg_total_purchase = total_purchase/total_count_pa
avg_total_purchase

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
Name: Price, dtype: float64

In [151]:
purchase_analysis_gender_df = pd.DataFrame ({"Purchase Count": purchase_count,
                                            "Average Purchase Price": average_purchase,
                                            "Total Purchase Value": total_purchase,
                                            "Average Purchase Total per Person": avg_total_purchase })
purchase_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [152]:
purchase_analysis_gender_df["Average Purchase Price"] = purchase_analysis_gender_df["Average Purchase Price"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df["Total Purchase Value"] = purchase_analysis_gender_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df["Average Purchase Total per Person"] = purchase_analysis_gender_df["Average Purchase Total per Person"].astype(float).map("${:,.2f}".format)
purchase_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [153]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [154]:
new_purchase_data=purchase_data.drop_duplicates(subset=["SN"])
new_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [155]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [156]:
age_purchase_data = new_purchase_data.copy() #use copy() to avoid settingwithcopywarning

In [157]:
age_purchase_data["Age Group"]=pd.cut(new_purchase_data["Age"], age_bins, labels= age_labels)
age_purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02,20-24
774,774,Jiskjask80,11,Male,92,Final Critic,4.19,10-14
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10

In [158]:
age_purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'Age Group'],
      dtype='object')

In [159]:
new_columns = ["SN","Age Group"]

In [160]:
new_age_purchase_data= age_purchase_data[new_columns]
new_age_purchase_data

                SN Age Group
0          Lisim78     20-24
1      Lisovynya38       40+
2       Ithergue48     20-24
3    Chamassasya86     20-24
4        Iskosia90     20-24
..             ...       ...
773         Hala31     20-24
774     Jiskjask80     10-14
775     Aethedru70     20-24
777     Yathecal72     20-24
778        Sisur91       <10

[576 rows x 2 columns]

In [161]:
organized_age_purchase_data=new_age_purchase_data.groupby("Age Group")
organized_age_purchase_data

In [162]:
age_group_SN = organized_age_purchase_data.count()
age_group_SN

            SN
Age Group
<10         17
10-14       22
15-19      107
20-24      258
25-29       77
30-34       52
35-39       31
40+         12

In [163]:
age_group = age_labels
age_group

['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [164]:
total_count = list(age_group_SN["SN"])
total_count

[17, 22, 107, 258, 77, 52, 31, 12]

In [165]:
total_players = new_purchase_data["SN"].count()
total_players

576

In [166]:
percentage_players = (total_count/total_players) *100
percentage_players

array([ 2.95138889,  3.81944444, 18.57638889, 44.79166667, 13.36805556,
        9.02777778,  5.38194444,  2.08333333])

In [167]:
age_demographics_df = pd.DataFrame ({"": age_group, 
                                     "Total Count": total_count, 
                                     "Percentage of Players": percentage_players})
age_demographics_df

          Total Count  Percentage of Players
0    <10           17               2.951389
1  10-14           22               3.819444
2  15-19          107              18.576389
3  20-24          258              44.791667
4  25-29           77              13.368056
5  30-34           52               9.027778
6  35-39           31               5.381944
7    40+           12               2.083333

In [168]:
age_demographics_df.set_index("", inplace=True)
age_demographics_df

       Total Count  Percentage of Players

<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [169]:
age_demographics_df["Percentage of Players"] = age_demographics_df["Percentage of Players"].astype(float).map("{:,.2f}%".format)
age_demographics_df

       Total Count Percentage of Players

<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [170]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [171]:
age_bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 50]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [172]:
age_purchase_analysis_data = purchase_data
age_purchase_analysis_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [173]:
age_purchase_analysis_data ["Age Ranges"]=pd.cut(age_purchase_analysis_data ["Age"], age_bins, labels= age_labels)
age_purchase_analysis_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [174]:
age_groupby_purchase_data = age_purchase_analysis_data.groupby("Age Ranges")

In [175]:
purchase_count = age_groupby_purchase_data.count()
purchase_count

            Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Ranges
<10                  23   23   23      23       23         23     23
10-14                28   28   28      28       28         28     28
15-19               136  136  136     136      136        136    136
20-24               365  365  365     365      365        365    365
25-29               101  101  101     101      101        101    101
30-34                73   73   73      73       73         73     73
35-39                41   41   41      41       41         41     41
40+                  13   13   13      13       13         13     13

In [176]:
avg_purchase_price = age_groupby_purchase_data["Price"].mean()
avg_purchase_price

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [177]:
total_purchase_value = age_groupby_purchase_data["Price"].sum()
total_purchase_value

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [178]:
# Utilizing each age group's non-repeated total count from the last section
purchase_analysis_total_count = total_count
purchase_analysis_total_count

[17, 22, 107, 258, 77, 52, 31, 12]

In [179]:
avg_total_purchase = total_purchase_value/purchase_analysis_total_count
avg_total_purchase

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
Name: Price, dtype: float64

In [180]:
age_purchase_analysis_df = pd.DataFrame ({"Purchase Count":purchase_count["Purchase ID"],
                                         "Average Purchase Price": avg_purchase_price,
                                         "Total Purchase Value": total_purchase_value,
                                         "Average Purchase Total per Person":avg_total_purchase})
age_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [181]:
age_purchase_analysis_df["Average Purchase Price"] = age_purchase_analysis_df["Average Purchase Price"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df["Total Purchase Value"] = age_purchase_analysis_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df["Average Purchase Total per Person"] = age_purchase_analysis_df["Average Purchase Total per Person"].astype(float).map("${:,.2f}".format)
age_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [182]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [183]:
user_count = purchase_data.groupby(["SN"]).count()["Price"].rename("Purchase Count")
user_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase Count, Length: 576, dtype: int64

In [184]:
unique_player_spenders = purchase_data.drop_duplicates(subset="SN")
#unique_player_spenders

In [185]:
unique_player_spenders_list = unique_player_spenders["SN"]
#unique_player_spenders_list

In [186]:
unique_player_spenders_list_df = pd.DataFrame(unique_player_spenders_list)
unique_player_spenders_list_df

                SN
0          Lisim78
1      Lisovynya38
2       Ithergue48
3    Chamassasya86
4        Iskosia90
..             ...
773         Hala31
774     Jiskjask80
775     Aethedru70
777     Yathecal72
778        Sisur91

[576 rows x 1 columns]

In [187]:
unique_player_purchase_count = pd.merge(unique_player_spenders_list_df, user_count, on="SN")
unique_player_purchase_count

                SN  Purchase Count
0          Lisim78               3
1      Lisovynya38               1
2       Ithergue48               1
3    Chamassasya86               1
4        Iskosia90               1
..             ...             ...
571         Hala31               1
572     Jiskjask80               1
573     Aethedru70               1
574     Yathecal72               1
575        Sisur91               1

[576 rows x 2 columns]

In [188]:
top_spender = purchase_data.groupby("SN")

In [189]:
player_purchase_count_group = top_spender["Price"].mean()
player_purchase_count_group

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [190]:
player_pay_sum = purchase_data.groupby(["SN"], as_index=False)["Price"].sum()
player_pay_sum

                SN  Price
0     Adairialis76   2.28
1      Adastirin33   4.48
2           Aeda94   4.91
3           Aela59   4.32
4        Aelaria33   1.79
..             ...    ...
571     Yathecal82   6.22
572     Yathedeu43   6.02
573  Yoishirrala98   4.58
574     Zhisrisu83   7.89
575      Zontibe81   8.03

[576 rows x 2 columns]

In [191]:
#player_pay_sum.sort_values("Price", ascending=False)

In [192]:
player_pay_avg = purchase_data.groupby(["SN"], as_index=False)["Price"].mean()
player_pay_avg

                SN     Price
0     Adairialis76  2.280000
1      Adastirin33  4.480000
2           Aeda94  4.910000
3           Aela59  4.320000
4        Aelaria33  1.790000
..             ...       ...
571     Yathecal82  2.073333
572     Yathedeu43  3.010000
573  Yoishirrala98  4.580000
574     Zhisrisu83  3.945000
575      Zontibe81  2.676667

[576 rows x 2 columns]

In [193]:
#player_pay_avg.sort_values("Price", ascending=False)

In [194]:
top_spender_merge_player_avg_purchase = pd.merge(unique_player_purchase_count,player_pay_avg, on="SN")
top_spender_merge_player_avg_purchase

                SN  Purchase Count  Price
0          Lisim78               3   3.34
1      Lisovynya38               1   1.56
2       Ithergue48               1   4.88
3    Chamassasya86               1   3.27
4        Iskosia90               1   1.44
..             ...             ...    ...
571         Hala31               1   1.02
572     Jiskjask80               1   4.19
573     Aethedru70               1   3.54
574     Yathecal72               1   3.46
575        Sisur91               1   4.19

[576 rows x 3 columns]

In [195]:
top_spender_merge_player_avg_purchase_total_purchase = pd.merge(top_spender_merge_player_avg_purchase,player_pay_sum, on="SN", suffixes=("_Average", "_Total"))
top_spender_merge_player_avg_purchase_total_purchase

                SN  Purchase Count  Price_Average  Price_Total
0          Lisim78               3           3.34        10.02
1      Lisovynya38               1           1.56         1.56
2       Ithergue48               1           4.88         4.88
3    Chamassasya86               1           3.27         3.27
4        Iskosia90               1           1.44         1.44
..             ...             ...            ...          ...
571         Hala31               1           1.02         1.02
572     Jiskjask80               1           4.19         4.19
573     Aethedru70               1           3.54         3.54
574     Yathecal72               1           3.46         3.46
575        Sisur91               1           4.19         4.19

[576 rows x 4 columns]

In [196]:
rename_top_spender_merge_player_avg_purchase_total_purchase = top_spender_merge_player_avg_purchase_total_purchase.rename(columns=
                                                                                                                                 {"Price_Average":"Average Purchase Price",
                                                                                                                                  "Price_Total":"Total Purchase Value"})
rename_top_spender_merge_player_avg_purchase_total_purchase

,SN,Purchase Count,Average Purchase Price,Total Purchase Value
0,Lisim78,3,3.34,10.02
1,Lisovynya38,1,1.56,1.56
2,Ithergue48,1,4.88,4.88
3,Chamassasya86,1,3.27,3.27
4,Iskosia90,1,1.44,1.44
...,...,...,...,...
571,Hala31,1,1.02,1.02
572,Jiskjask80,1,4.19,4.19
573,Aethedru70,1,3.54,3.54
574,Yathecal72,1,3.46,3.46
575,Sisur91,1,4.19,4.19

In [197]:
rename_top_spender_merge_player_avg_purchase_total_purchase.set_index("SN", inplace=True)

In [198]:
total_spender_analysis =rename_top_spender_merge_player_avg_purchase_total_purchase.sort_values("Total Purchase Value", ascending=False)
total_spender_analysis

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                   5                3.792000                 18.96
Idastidru52                 4                3.862500                 15.45
Chamjask73                  3                4.610000                 13.83
Iral74                      4                3.405000                 13.62
Iskadarya95                 3                4.366667                 13.10
...                       ...                     ...                   ...
Frichjaskan98               1                1.020000                  1.02
Eudanu84                    1                1.020000                  1.02
Chanirra79                  1                1.010000                  1.01
Aidai61                     1                1.010000                  1.01
Alo38                       1                1.000000                  1.00

[576 rows x 3 columns]

In [199]:
total_spender_analysis["Average Purchase Price"] = total_spender_analysis["Average Purchase Price"].astype(float).map("${:,.2f}".format)
total_spender_analysis["Total Purchase Value"] = total_spender_analysis["Total Purchase Value"].astype(float).map("${:,.2f}".format)
total_spender_analysis.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [200]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [201]:
popular_items = purchase_data.groupby(["Item ID", "Item Name"])

In [202]:
#popular_item_count = popular_items["Item ID"].count() cant reset ID using this
#popular_item_count

In [203]:
#reset_index_popular_item_count = popular_item_count.reset_index()
item = purchase_data.groupby(["Item ID","Item Name"]).count()["Price"].rename("Purchase Count")
item

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Purchase Count, Length: 179, dtype: int64

In [204]:
reset_index_popular_item_count = item.reset_index()
reset_index_popular_item_count

     Item ID                                     Item Name  Purchase Count
0          0                                      Splinter               4
1          1                                      Crucifer               4
2          2                                       Verdict               6
3          3                                  Phantomlight               6
4          4                            Bloodlord's Fetish               5
..       ...                                           ...             ...
174      178  Oathbreaker, Last Hope of the Breaking Storm              12
175      179               Wolf, Promise of the Moonwalker               6
176      181                                 Reaper's Toll               5
177      182                                     Toothpick               3
178      183                           Dragon's Greatsword               3

[179 rows x 3 columns]

In [205]:
item_price = popular_items["Price"].mean()
item_price

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [206]:
total_purchase = popular_items["Price"].sum()
total_purchase

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [207]:
popular_item_merge = pd.merge(reset_index_popular_item_count, item_price, on="Item ID", how="inner")
popular_item_merge

,Item ID,Item Name,Purchase Count,Price
0,0,Splinter,4,1.2800
1,1,Crucifer,4,2.9425
2,2,Verdict,6,2.4800
3,3,Phantomlight,6,2.4900
4,4,Bloodlord's Fetish,5,1.7000
...,...,...,...,...
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300
175,179,"Wolf, Promise of the Moonwalker",6,4.4800
176,181,Reaper's Toll,5,1.6600
177,182,Toothpick,3,4.0300
178,183,Dragon's Greatsword,3,1.0900

In [208]:
popular_item_merge2 = pd.merge(popular_item_merge,total_purchase, on="Item ID")
popular_item_merge2

,Item ID,Item Name,Purchase Count,Price_x,Price_y
0,0,Splinter,4,1.2800,5.12
1,1,Crucifer,4,2.9425,11.77
2,2,Verdict,6,2.4800,14.88
3,3,Phantomlight,6,2.4900,14.94
4,4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...,...
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
175,179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
176,181,Reaper's Toll,5,1.6600,8.30
177,182,Toothpick,3,4.0300,12.09
178,183,Dragon's Greatsword,3,1.0900,3.27

In [209]:
rename_most_popular_items_df = popular_item_merge2.rename(columns={"Price_x":"Item Price",
                                                           "Price_y": "Total Purchase Value"})
rename_most_popular_items_df

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,0,Splinter,4,1.2800,5.12
1,1,Crucifer,4,2.9425,11.77
2,2,Verdict,6,2.4800,14.88
3,3,Phantomlight,6,2.4900,14.94
4,4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...,...
174,178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
175,179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
176,181,Reaper's Toll,5,1.6600,8.30
177,182,Toothpick,3,4.0300,12.09
178,183,Dragon's Greatsword,3,1.0900,3.27

In [210]:
rename_most_popular_items_df.set_index("Item ID", inplace=True)

In [211]:
most_popular_items_df =rename_most_popular_items_df.sort_values("Purchase Count", ascending=False)
#most_popular_items_df

In [212]:
most_popular_items_df["Item Price"] = most_popular_items_df["Item Price"].astype(float).map("${:,.2f}".format)
most_popular_items_df["Total Purchase Value"] = most_popular_items_df["Total Purchase Value"].astype(float).map("${:,.2f}".format)
most_popular_items_df.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [218]:
most_profitable_items = rename_most_popular_items_df.sort_values("Total Purchase Value", ascending=False)
most_profitable_items.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

In [219]:
most_profitable_items["Item Price"] = most_profitable_items["Item Price"].astype(float).map("${:,.2f}".format)
most_profitable_items["Total Purchase Value"] = most_profitable_items["Total Purchase Value"].astype(float).map("${:,.2f}".format)
most_profitable_items.head()

,Item Name,Purchase Count,Item Price,Total Purchase Value
Item ID,,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80